# 1. تحديد بيئة التشغيل الأساسية (استخدمنا نسخة alpine لأن مساحتها صغيرة جداً وسريعة في الـ CI/CD)
FROM node:24-alpine

# 2. تحديد مجلد العمل داخل الحاوية
WORKDIR /app

# 3. نسخ ملفات الـ package أولاً (خدعة احترافية لتسريع البناء عبر الـ Caching)
COPY package*.json ./

# 4. تثبيت الحزم (أمر --omit=dev يمنع تثبيت حزم التطوير لتقليل مساحة الحاوية في الإنتاج)
RUN npm install --omit=dev

# 5. نسخ باقي ملفات الكود إلى الحاوية
COPY . .

# 6. فتح البورت الذي سيعمل عليه التطبيق
EXPOSE 8080

# 7. أمر تشغيل التطبيق
CMD ["node", "index.js"]